In [1]:
import pandas as pd

import pandas as pd
df = pd.read_csv('/home/catpc/machine lerarning/CAR DETAILS FROM CAR DEKHO.csv')
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [2]:
df = df[['selling_price','km_driven','year']]
df.head()

   selling_price  km_driven  year
0          60000      70000  2007
1         135000      50000  2007
2         600000     100000  2012
3         250000      46000  2017
4         450000     141000  2014

# applying Normalization : MinMax Scalling

# x(scaled) = (x-x(min))/x(max)-x(min)

In [3]:
from sklearn.preprocessing import MinMaxScaler

In [4]:
scaler = MinMaxScaler()

In [8]:
scald_df = scaler.fit_transform(df)
# প্রথমে ডেটা থেকে min ও max বের করে (fit)
#তারপর সেই মান দিয়ে ডেটাকে 0-1 এর মধ্যে স্কেল করে (transform)

In [13]:
scald_df

array([[0.0045045 , 0.08678301, 0.53571429],
       [0.01295045, 0.06198751, 0.53571429],
       [0.06531532, 0.12397626, 0.71428571],
       ...,
       [0.01013514, 0.10290008, 0.60714286],
       [0.09515766, 0.11157851, 0.85714286],
       [0.02308559, 0.04958976, 0.85714286]])

In [14]:
scald_df = pd.DataFrame(data=scald_df, columns=df.columns)

In [16]:
scald_df.head()

   selling_price  km_driven      year
0       0.004505   0.086783  0.535714
1       0.012950   0.061988  0.535714
2       0.065315   0.123976  0.714286
3       0.025901   0.057028  0.892857
4       0.048423   0.174807  0.785714

# Train Test Split

In [17]:
from sklearn.model_selection import train_test_split

In [19]:
x = df.drop('selling_price',axis=1)
y = df['selling_price']

In [20]:
x

      km_driven  year
0         70000  2007
1         50000  2007
2        100000  2012
3         46000  2017
4        141000  2014
...         ...   ...
4335      80000  2014
4336      80000  2014
4337      83000  2009
4338      90000  2016
4339      40000  2016

[4340 rows x 2 columns]

In [21]:
y

0        60000
1       135000
2       600000
3       250000
4       450000
         ...
4335    409999
4336    409999
4337    110000
4338    865000
4339    225000
Name: selling_price, Length: 4340, dtype: int64

In [22]:
x_train,x_test,y_train,y_test = train_test_split(
x,y,test_size=0.2, random_state=42
)

In [23]:
x_train

      km_driven  year
3679     400000  2006
2093      50000  2015
3220      20000  2019
2422      80000  2017
1867     100000  2005
...         ...   ...
3444      50000  2006
466       80000  2011
3092      51000  2016
3772      80000  2013
860       80000  2013

[2907 rows x 2 columns]

In [24]:
x_test

      km_driven  year
3978      80000  2010
1448      27000  2019
2664      41723  2008
17       141000  2014
1634      60000  2016
...         ...   ...
572       10000  2018
4278       1000  2020
288       90000  2011
1615      46507  2017
2330      20000  2017

[1433 rows x 2 columns]

In [25]:
y_train

3679    400000
2093    500000
3220    210000
2422    650000
1867    100000
         ...
3444    500000
466     133000
3092    665000
3772    250999
860     175000
Name: selling_price, Length: 2907, dtype: int64

In [26]:
y_test

3978     165000
1448     250000
2664     120000
17       450000
1634     730000
         ...
572     3800000
4278     614000
288      350000
1615     600000
2330     540000
Name: selling_price, Length: 1433, dtype: int64

In [27]:
x_train.shape

(2907, 2)

In [29]:
x_test.shape

(1433, 2)

In [31]:
y_train.shape

(2907,)

In [32]:
y_test.shape

(1433,)

# Feature-Scalling: Normalization: Minmax Scaler

In [33]:
x_train_scalled = scaler.fit_transform(x_train)
x_test_scalled = scaler.transform(x_test)

In [34]:
x_train_scalled

array([[0.49590874, 0.5       ],
       [0.06198751, 0.82142857],
       [0.02479426, 0.96428571],
       ...,
       [0.06322728, 0.85714286],
       [0.09918076, 0.75      ],
       [0.09918076, 0.75      ]])

In [35]:
x_test_scalled

array([[0.09918076, 0.64285714],
       [0.03347268, 0.96428571],
       [0.05172589, 0.57142857],
       ...,
       [0.11157851, 0.67857143],
       [0.05765697, 0.89285714],
       [0.02479426, 0.89285714]])

In [38]:
x_train_scalled = pd.DataFrame(data = x_train_scalled,columns=x_train.columns)
x_test_scalled = pd.DataFrame(data=x_test_scalled, columns=x_test.columns)

In [39]:
x_train_scalled

      km_driven      year
0      0.495909  0.500000
1      0.061988  0.821429
2      0.024794  0.964286
3      0.099181  0.892857
4      0.123976  0.464286
...         ...       ...
2902   0.061988  0.500000
2903   0.099181  0.678571
2904   0.063227  0.857143
2905   0.099181  0.750000
2906   0.099181  0.750000

[2907 rows x 2 columns]

In [40]:
x_test_scalled

      km_driven      year
0      0.099181  0.642857
1      0.033473  0.964286
2      0.051726  0.571429
3      0.174807  0.785714
4      0.074385  0.857143
...         ...       ...
1428   0.012397  0.928571
1429   0.001239  1.000000
1430   0.111579  0.678571
1431   0.057657  0.892857
1432   0.024794  0.892857

[1433 rows x 2 columns]